package chp4;

/**
 * @author WuChao
 * @since 2021/4/28 上午11:18
 */
public class _12 {
    /**
     * 程序员面试金典(version 6) - 面试题 04.10. 检查子树
     * 难度: medium
     * <p>
     * 检查子树。你有两棵非常大的二叉树：T1，有几万个节点；T2，有几万个节点。设计一个算法，判断 T2 是否为 T1 的子树。
     *
     * 如果 T1 有这么一个节点 n，其子树与 T2 一模一样，则 T2 为 T1 的子树，也就是说，从节点 n 处把树砍断，得到的树与 T2 完全相同。
     *
     * 来源：力扣（LeetCode）
     * 链接：https://leetcode-cn.com/problems/check-subtree-lcci
     * 著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
     *
     * <p>
     * 示例：
     * 给定如下二叉树
     *
     *         2
     *        / \
     *       1   3
     * 返回：
     * [
     *    [2,1,3],
     *    [2,3,1]
     * ]
     * <p>
     * 数据范围：
     */
}
