package yuanfudao._2021_2;

/**
 * @author WuChao
 * @create 2021/6/30 14:59
 */
public class Main_2 {
    /**
     * [编程题]最大子矩阵
     * 小猿发现了一根侧面写着数字的圆柱，仔细观察发现柱子的侧面被分割成了N行M列的若干个小格子，每个格子里写着一个数字。
     * 你能帮助小猿找到圆柱侧面的最大子矩阵吗？
     *
     * 输入描述:
     * 第一行输入两个数N M （1 ≤ N ≤ 100, 1 ≤ M ≤ 1000）
     * 接下来N行，每行输入M个数字
     *
     *
     * 输出描述:
     * 请输出圆柱体侧面的最大子矩阵和
     * 示例1
     * 输入
     * 2 3
     * 2 1 2
     * 3 -2 4
     * 输出
     * 11
     * 说明
     * 因为是圆柱体侧面，矩阵第一列和第三列相连，因此最大子矩阵为[[2, 2], [4, 3]]，矩阵和为11
     */
}
