package leetcode_hot100.top20;

/**
 * @author WuChao
 * @create 2021/7/5 13:22
 */
public class _31 {
    /**
     * Leetcode 热题 Top 100
     * <p>
     * 31. 下一个排列
     * 难度：medium
     * <p>
     * 实现获取 下一个排列 的函数，算法需要将给定数字序列重新排列成字典序中下一个更大的排列。
     *
     * 如果不存在下一个更大的排列，则将数字重新排列成最小的排列（即升序排列）。
     *
     * 必须 原地 修改，只允许使用额外常数空间。
     *
     * <p>
     * 示例
     * <p>
     * 输入：nums = [1,2,3]
     * 输出：[1,3,2]
     *
     * 输入：nums = [3,2,1]
     * 输出：[1,2,3]
     * <p>
     * 输入：n = 1
     * 输出：["()"]
     * <p>
     * 范围
     * 1 <= n <= 8
     */
}
