package leetcode_everyday._2022.Apr;

/**
 * @author WuChao
 * @create 2022/4/15 9:10
 */


// 题目描述有问题

/**
 * 每日一题：2022/4/15
 * <p>
 * 385. 迷你语法分析器
 * <p>
 * 难度：medium
 * <p>
 * 给定一个字符串 s 表示一个整数嵌套列表，实现一个解析它的语法分析器并返回解析的结果 NestedInteger 。
 * <p>
 * 列表中的每个元素只可能是整数或整数嵌套列表
 * <p>
 * 现在回答两个问题：至少多少行能放下S，以及最后一行使用的宽度是多少个单位？将你的答案作为长度为2的整数列表返回。
 * <p>
 * 示例
 * <p>
 * 示例 1:
 * <p>
 * 输入：s = "[123,[456,[789]]]",
 * <p>
 * 输出：[123,[456,[789]]]
 * <p>
 * 解释：返回一个 NestedInteger 对象包含一个有两个元素的嵌套列表：
 * 1. 一个 integer 包含值 123
 * 2. 一个包含两个元素的嵌套列表：
 * i.  一个 integer 包含值 456
 * ii. 一个包含一个元素的嵌套列表
 * a. 一个 integer 包含值 789
 * <p>
 * 范围
 * <p>
 * 1 <= s.length <= 5 * 104
 * s 由数字、方括号 "[]"、负号 '-' 、逗号 ','组成
 * 用例保证 s 是可解析的 NestedInteger
 * 输入中的所有值的范围是 [-10^6, 10^6]
 */
public class _15_385 {

}
