package leetcodetest.Jun;

/**
 * @author WuChao
 * @create 2021/6/30 9:43
 */
public class _30 {
    /**
     * 每日一题：2021/6/30
     * 剑指 Offer 37. 序列化二叉树
     * 难度: hard
     * <p>
     * 请实现两个函数，分别用来序列化和反序列化二叉树。
     *
     * 你需要设计一个算法来实现二叉树的序列化与反序列化。这里不限定你的序列 / 反序列化算法执行逻辑，
     * 你只需要保证一个二叉树可以被序列化为一个字符串并且将这个字符串反序列化为原始的树结构。
     *
     * 提示：输入输出格式与 LeetCode 目前使用的方式一致，详情请参阅 LeetCode 序列化二叉树的格式。你并非必须采取这种方式，
     * 你也可以采用其他的方法解决这个问题。
     *
     * <p>
     * 例如，
     * <p>
     * 1 -> A
     * 2 -> B
     * 3 -> C
     * ...
     * 26 -> Z
     * 27 -> AA
     * 28 -> AB
     * ...
     * <p>
     * 示例
     * 输入: 1
     * 输出: "A"
     * 示例 2:
     * <p>
     * 输入: 28
     * 输出: "AB"
     * 示例 3:
     * <p>
     * 输入: 701
     * 输出: "ZY"
     * <p>
     * 数据范围：
     */
}
